import React from "react";
import style from "./Single.module.css";

import SideBar from "../Dashboard/SideBar/SideBar";
export default function Single() {
  return (
    <div className="d-flex  ">
      <SideBar />
      <div className={"d-flex flex-column mt-3  " + style.singlePost}>
        <img
          src="https://th.bing.com/th/id/R.6743cb9021a910335c6a7f27de6f8e20?rik=UBykEik9KiH8Ow&pid=ImgRaw&r=0"
          alt=""
        />
        <div className={" d-flex my-2   " + style.centerSection}>
          <h1>لورم ایپسوم متن ساختگی با تولید سادگی </h1>
          <div className={"  " + style.buttons}>
            <i className="fa-regular fa-pen-to-square"></i>
            <i className="fa-solid fa-trash"></i>
          </div>
        </div>
        <div
          className={
            "d-flex justify-content-between text-brown  px-5 py-2   " +
            style.author
          }
        >
          <p>نویسنده : فائزه</p>
          <p>1ساعت پیش </p>
        </div>
        <div className={"  " + style.describtion}>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از
          صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
          روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
          تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می
          باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
          جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
          طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
          ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در
          ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل
          حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
          طراحی اساسا مورد استفاده قرار گیرد. لورم ایپسوم متن ساختگی با تولید
          سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها
          و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای
          شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای
          کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
          شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت
          بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو
          در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و
          دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان
          مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل
          دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. لورم ایپسوم متن ساختگی
          با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
          چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و
          برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود
          ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و
          آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها
          شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ
          پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و
          دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان
          مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل
          دنیای موجود طراحی اساسا مورد استفاده
        </div>
      </div>
    </div>
  );
}
